Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70Q20.PIC
      <edc:SFRDef edc:_addr="0x40050030" edc:access="------nnnnnnnn--nnnnnn--nnnnnnnn" edc:cname="GMAC_IMR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MFS" edc:desc="Management Frame Sent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RCOMP" edc:desc="Receive Complete" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXUBR" edc:desc="RX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXUBR" edc:desc="TX Used Bit Read" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TUR" edc:desc="Transmit Underrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RLEX" edc:desc="Retry Limit Exceeded" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFC" edc:desc="Transmit Frame Corruption Due to AHB Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOMP" edc:desc="Transmit Complete" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ROVR" edc:desc="Receive Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HRESP" edc:desc="HRESP Not OK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFNZ" edc:desc="Pause Frame with Non-zero Pause Quantum Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTZ" edc:desc="Pause Time Zero" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFTR" edc:desc="Pause Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXINT" edc:desc="External Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DRQFR" edc:desc="PTP Delay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFR" edc:desc="PTP Sync Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRQFT" edc:desc="PTP Delay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SFT" edc:desc="PTP Sync Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFR" edc:desc="PDelay Request Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFR" edc:desc="PDelay Response Frame Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRQFT" edc:desc="PDelay Request Frame Transmitted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDRSFT" edc:desc="PDelay Response Frame Transmitted" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050034" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_MAN" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="PHY Data" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="WTN" edc:desc="Write Ten" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="REGA" edc:desc="Register Address" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PHYA" edc:desc="PHY Address" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="OP" edc:desc="Operation" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CLTTO" edc:desc="Clause 22 Operation" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WZO" edc:desc="Write ZERO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050038" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="GMAC_RPQ" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPQ" edc:desc="Received Pause Quantum" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005003C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TPQ" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TPQ" edc:desc="Transmit Pause Quantum" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050040" edc:access="n-------------------nnnnnnnnnnnn" edc:cname="GMAC_TPSF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TPB1ADR" edc:desc="Transmit Partial Store and Forward Address" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="ENTXP" edc:desc="Enable TX Partial Store and Forward Operation" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050044" edc:access="n-------------------nnnnnnnnnnnn" edc:cname="GMAC_RPSF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB1ADR" edc:desc="Receive Partial Store and Forward Address" edc:nzwidth="0xC"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="ENRXP" edc:desc="Enable RX Partial Store and Forward Operation" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050048" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="GMAC_RJFML" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FML" edc:desc="Frame Max Length" edc:nzwidth="0xE"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005004C" edc:offset="0x34"/>
      <edc:SFRDef edc:_addr="0x40050080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_HRB" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Hash Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050084" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_HRT" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Hash Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050088" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x400500A8" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TIDM1" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TID" edc:desc="Type ID Match 1" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ENID1" edc:desc="Enable Copying of TID Matched Frames" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
