Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70Q20.PIC
      <edc:SFRDef edc:_addr="0x40064008" edc:access="--nn--nn-----nnn--nn--n-nnnnn-nn" edc:cname="AFEC1_EMR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:desc="Comparison Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates an event when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates an event when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates an event when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates an event when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPSEL" edc:desc="Comparison Selected Channel" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPALL" edc:desc="Compare All Channels" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMPFILTER" edc:desc="Compare Event Filtering" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RES" edc:desc="Resolution" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NO_AVERAGE" edc:desc="12-bit resolution, AFE sample rate is maximum (no averaging)." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="OSR4" edc:desc="13-bit resolution, AFE sample rate divided by 4 (averaging)." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OSR16" edc:desc="14-bit resolution, AFE sample rate divided by 16 (averaging)." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="OSR64" edc:desc="15-bit resolution, AFE sample rate divided by 64 (averaging)." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="OSR256" edc:desc="16-bit resolution, AFE sample rate divided by 256 (averaging)." edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TAG" edc:desc="TAG of the AFEC_LDCR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STM" edc:desc="Single Trigger Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SIGNMODE" edc:desc="Sign Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SE_UNSG_DF_SIGN" edc:desc="Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SE_SIGN_DF_UNSG" edc:desc="Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ALL_UNSIGNED" edc:desc="All channels: Unsigned conversions." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ALL_SIGNED" edc:desc="All channels: Signed conversions." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006400C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC1_SEQ1R" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USCH0" edc:desc="User Sequence Number 0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH1" edc:desc="User Sequence Number 1" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH2" edc:desc="User Sequence Number 2" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH3" edc:desc="User Sequence Number 3" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH4" edc:desc="User Sequence Number 4" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH5" edc:desc="User Sequence Number 5" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH6" edc:desc="User Sequence Number 6" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH7" edc:desc="User Sequence Number 7" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064010" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="AFEC1_SEQ2R" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USCH8" edc:desc="User Sequence Number 8" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH9" edc:desc="User Sequence Number 9" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH10" edc:desc="User Sequence Number 10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USCH11" edc:desc="User Sequence Number 11" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064014" edc:access="--------------------wwwwwwwwwwww" edc:cname="AFEC1_CHER" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:desc="Channel 8 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:desc="Channel 9 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:desc="Channel 10 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:desc="Channel 11 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064018" edc:access="--------------------wwwwwwwwwwww" edc:cname="AFEC1_CHDR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:desc="Channel 8 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:desc="Channel 9 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:desc="Channel 10 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:desc="Channel 11 Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006401C" edc:access="--------------------rrrrrrrrrrrr" edc:cname="AFEC1_CHSR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CH0" edc:desc="Channel 0 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:desc="Channel 1 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:desc="Channel 2 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:desc="Channel 3 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:desc="Channel 4 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:desc="Channel 5 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:desc="Channel 6 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:desc="Channel 7 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:desc="Channel 8 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:desc="Channel 9 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:desc="Channel 10 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:desc="Channel 11 Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40064020" edc:access="----rrrr--------rrrrrrrrrrrrrrrr" edc:cname="AFEC1_LCDR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LDATA" edc:desc="Last Data Converted" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CHNB" edc:desc="Channel Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
